Repository: LETARTARE/Generic-CAM
Catalog: i18n/*/GenericCAM.po
Languages: fr

source: CAM Processor for CNC Machines
fr: Processeur CAM pour machines CNC

source: <filepath of document to open>
fr: <chemin du document à ouvrir>

source: Spaceball by Spacetec IMC
fr: Boule spatiale de Spacetec IMC

source: Spaceorb by Spacetec IMC
fr: Manette spatiale de Spacetec IMC

source: Spacemouse by Logitech/3DConnexion
fr: Souris spatiale de Logitech/3DConnexion

source: Serial port:
fr: Liaison série :

source: SpaceBall
fr: Boule spatiale

source: SpaceOrb
fr: Manette spatiale

source: SpaceMouse
fr: Souris spatiale

source: Type of controller
fr: Type de controleur

source: Connect
fr: Connexion

source: Disconnect
fr: Déconnexion

source: Close
fr: Fermer

source: Setup 6DOF Controller
fr: Configurer le controleur d'axes

source: No run selected...
fr: Aucune course sélectionnée...

source: No Object selected.
fr: Aucun de sélectionné

source: Change object selectionfor run.
fr: Changer la sélection d'objet pour démarrer

source: Change axis X.
fr: Changer l'axe X

source: Change axis Y.
fr: Changer l'axe X.

source: Change axis Z.
fr: Changer l'axe Z.

source: Change stockobject selection for run.
fr: Changer la sélection d'objet pour démarrer

source: Select origin.
fr: Sélectionner l'origine.

source: Change size.
fr: Changer la taille.

source: Change type.
fr: Changer le ttpe.

source: Change stock size X.
fr: Changer la taille du brut en X.

source: Change stock size Y.
fr: Changer la taille du brut en Y.

source: Change stock size Z.
fr: Changer la taille du brut en Z.

source: Selected machine.
fr: Machine sélectionné.

source: Setup &MIDI
fr: Configurer &MIDI

source: Setup &Units
fr: Choix des &Unités

source: Open machine description...
fr: Ouvrir la description de la machine

source: All machine descriptions (*.lua;*.zip)|*.lua;*.zip|Machine descriptions (LUA Files) (*.lua)|*.lua|Packed Machine descriptions (*.zip)|*.zip|Text files (*.txt)|*.txt|All files|*.*
fr: Toutes les descriptions machine (*.lua,*.zip)| *.lua,|*.zip|Description machine (LUA Files) (*.lua)|*.lua|Descriptions machines compresser (*.zip)|*.zip|Text files (*.txt)|*.txt|Tous fichiers|*.*

source: Save machine description...
fr: Sauvegarder la description de la machine...

source: Machine descriptions (LUA Files) (*.lua)|*.lua|Text files (*.txt)|*.txt|All files|*.*
fr: Description de la machine (LUA Files) (*.lua)|*.lua|Text files (*.txt)|*.txt|All files|*.*

source: Setup &Stereo 3D
fr: Configuration &Stéréo 3D

source: Setup 6DOF &Controller
fr: &Configurer le controleur d'axes

source: No object selected...
fr: Aucune sélection d'objet...

source: Multiple object selected...
fr: Objet multiple sélectionné...

source: Export toolpath -
fr: Export du chemin d'outil -

source: Project
fr: Projet

source: Local toolbox
fr: Boite à outils locale

source: Update the generator settings.
fr: Actualiser la configuration du générateur

source: File is invalid:
fr: Fichier invalide:

source: Load Object:
fr: Charger un objet

source: Not a valid project file:
fr: Fichier projet invalide:

source: Unknown file extension:
fr: Extension de fichier inconne:

source: Revert to saved
fr: Reprendre la sauvegarde

source: modified
fr: modifié

source: not modified
fr: non modifié

source: Save
fr: Sauvegarder

source: Save as ...
fr: Sauvegarder sous ...

source: Enter new project name:
fr: Nom du nouveau projet:

source: Rename Project
fr: Renommer un projet

source: Project renamed to
fr: Renommer le projet en

source: Change Language
fr: Changer la langue

source: Setup &Paths
fr: Choix des &Chemins

source: Load Object...
fr: Charger un objet...

source: All supported files (*.obj; *.dxf; *.stl; *.gts)|*.obj;*.dxf;*DXF;*.stl;*.STL;*.gts;*.GTS|Wavefront OBJ Files (*.obj)|*.obj;*.OBJ|DXF Files (*.dxf)|*.dxf;*.DXF|Stereolithography files (STL files) (*.stl)|*.stl;*.STL|GTS files (*.gts)|*.gts;*.GTS|All files|*.*
fr: Fichiers supportés (*.obj; *.dxf; *.stl; *.gts)|*.obj;*.dxf;*DXF;*.stl;*.STL;*.gts;*.GTS|Wavefront OBJ Fichiers (*.obj)|*.obj;*.OBJ|DXF Fichiers (*.dxf)|*.dxf;*.DXF|Fichers Stereolithographique s (FichiersSTL f) (*.stl)|*.stl;*.STL|GTS files (*.gts)|*.gts;*.GTS|Tous fichiers||*.*

source: Enter new name:
fr: Fournir un nouveau nom

source: Rename Object
fr: Renommer un objet

source: Object renamed to
fr: Objet renommé en

source: Object
fr: Objet

source: deleted.
fr: supprimer.

source: : Flipped normal vectors
fr: Vecteurs normaux inversés

source: Run %Iu
fr: Exécuter %Iu

source: Run %zu
fr: Exécuter %zu

source: - Object:
fr: - Objet:

source: Adding run
fr: Ajout de l'exécution

source: Run renamed to
fr: L'exécutable renomé en

source: Remove run
fr: Supprimer l'exécutable

source: Outline Dexel
fr: Aperçu Dexel

source: Load from file
fr: Charger depuis un fichier

source: GeneratorTest
fr: Test du générateur

source: AreaMillingDynamic
fr: Zone dynamique de fraisage

source: Drill Dexel
fr: Perçage Dexel

source: Area Grid Dexel
fr: Zone grillagée Dexel

source: Add generator to run.
fr: Ajout d'un générateur d'exécution

source: Deleting generator from run.
fr: Supprimer un générateur d'exécution

source: &Rename Project
fr: &Renommer le projet

source: &Save Project
fr: &Sauvegarder un projet

source: Save Project &As ...
fr: Sauvegarder le projet& sous ...

source: &Quit
fr: &Quitter

source: &Load Object
fr: &Charger un objet

source: &Modify Object
fr: &Modifier un objet

source: &Flip Normals
fr: &Inverser les normales

source: &Rename Object
fr: &Renommer un objet

source: &Delete Object
fr: &Supprimer l'objet

source: &Add Run
fr: &Ajout d'exécutable

source: &Generate Toolpath
fr: &Générer la trajectoire

source: &Edit Run
fr: &Editer l'exécution

source: &Rename Run
fr: &Renommer l'exécution

source: &Delete Run
fr: &Supprimer l'exécution

source: E&xport Toolpaths
fr: E&xporter les trajectoires

source: &Edit Generator
fr: &Edition du générerateur

source: &Delete Generator
fr: &Supprimer le générerateur

source: E&xport Toolpath
fr: E&xporterr la trajectoire

source: Generator renamed to
fr: Renommer le générateur en

source: Generating Toolpaths...
fr: Génération des trajectoires

source: &Help
fr: &Aide

source: About
fr: A propos

source: Log Window
fr: Fenêtre journal

source: Objects
fr: Objets

source: Run
fr: Exécuter

source: New
fr: Nouveau

source: Open
fr: Ouvrir

source: View
fr: Vue

source: Preferences
fr: Préférences

source: Stereo 3D
fr: Stéréo 3D

source: Edit
fr: Edition

source: Undo
fr: Défaire

source: Redo
fr: Refaire

source: Object
fr: Objet

source: Load
fr: Charger

source: Flip Normals
fr: Inverser les normales

source: Modify
fr: Modifier

source: Setup
fr: Configuration

source: Toolpath
fr: Chemin

source: Drilling
fr: Perçage

source: Multi-Axis
fr: Multi-Axes

source: Post-Process
fr: Post-Processeur

source: Simulate
fr: Simuler

source: Export
fr: Exporter

source: Manage
fr: Gérer

source: Tool- Library
fr: Bibliothèque d'outils

source: Machine Debugger
fr: Déboquer la machine:

source: Tools
fr: Outils

source: Test G-Code
fr: Tester le G-Code

source: Current size of object
fr: Dimension courante de l'objet

source: Quick scale:
fr: Echelle rapide:

source: Calculate scaling factors
fr: Calcul des facteurs d'échelle

source: Calculate
fr: Calculer

source: Scale proportionally
fr: Echelle proportionnelle

source: Rescale
fr: Retaillage

source: Scale
fr: Echelle

source: Proportional:
fr: Proportionnel:

source: Move
fr: Déplacement

source: Step:
fr: Pas:

source: Align
fr: Aligner

source: Align with top
fr: Aligner au sommet

source: Align with middle
fr: Aligner au milieu

source: Align with bottom
fr: Aligner sur le bas

source: Center
fr: Centre

source: Rotate stepwise
fr: Pas de la rotation

source: Rotate
fr: Rotation

source: Mirror on
fr: Avec miroir

source: X axis
fr: Axe X

source: Y axis
fr: Axe Y

source: Z axis
fr: Axe Z

source: Flip normal vectors
fr: Inverser les vecteurs normaux

source: Mirror
fr: Miroir

source: Select...
fr: Sélection...

source: Coordinate System
fr: Systèmes de coordonnées

source: Select X...
fr: Choisir X...

source: Select Y...
fr: Choisir Y...

source: Select Z...
fr: Choisir Z...

source: Coordinates
fr: Coordonnées

source: Get box size from object
fr: Dimension de la boite de l'objet

source: Top
fr: haut

source: Bottom
fr: Bas

source: Alignment
fr: Alignement

source: Box
fr: Boite

source: Select ...
fr: Sélection...

source: Object as stock
fr: Objet comme brut

source: Stock
fr: Brut

source: Origin
fr: Origine

source: Size
fr: Taille

source: Slotwidth:
fr: largeurConnecteur;

source: Width:
fr: Largeur:

source: Height:
fr: Hauteur:

source: Level
fr: Niveau

source: Manual
fr: Manuel

source: Individual automatic level
fr: Niveau automatique individuel

source: Common automatic level
fr: Niveau automatique commun

source: Level:
fr: Niveau:

source: Gridlines X
fr: Lignes de grille X

source: Offset:
fr: Décalage:

source: Gridlines Y
fr: Lignes de grille Y

source: Gridlines Outline
fr: Apercu de la grille

source: Count:
fr: Compte:

source: Machine description (optional):
fr: Description machine (optionel):

source: Select a file
fr: Choix d'un fichier

source: Geometry
fr: Géometrie

source: Tool
fr: Outil

source: Add tool from library...
fr: Ajout d'outil depuis la bibliothèque...

source: Feeds - Speeds
fr: Vitesses - Pieds

source: Spindle-speed:
fr: Viresse-broche:

source: Feed-rate:
fr: Avance:

source: Margin:
fr: marge:

source: Side:
fr: Face:

source: Below:
fr: Dessous:

source: Clearance Height:
fr: Hauteur de dépassement

source: Parameter:
fr: Paramêtre:

source: Update
fr: Actualiser

source: Temporary Button until Command-Event passing is working. (This button will be removed by then.)
fr: Bouton temporaire jusqu'à ce que le passage de l'événement de commande fonctionne. (Ce bouton sera supprimé d'ici là)

source: Time:
fr: Durée:

source: First
fr: Premier

source: Previous toolpath
fr: Trajectoire précédente

source: Play / Stop
fr: Marche / Arrêt

source: Next toolpath
fr: Prochaine trajectoire

source: Last
fr: Dernier

source: Workpiece
fr: Pièce

source: Workpiece + Tool
fr: Pièce + Outil

source: Workpiece + Tool + Holder
fr: Pièce + Outil + Etau

source: Workpiece + Tool + Holder + Machine
fr: Pièce + Outil + Etau + Machine

source: Center Workpiece
fr: Centre Pièce

source: Center Tool
fr: Centre Outil

source: Center Machine
fr: Centre Machine

source: Refresh
fr: Actualiser

source: NC files (*.cnc;*.nc)|*.cnc;*.nc|Text files (*.txt)|*.txt|All files (*.*)|*.*
fr: Fichiers NC (*.cnc *.nc)|*.cnc *.nc|Fichiers texte (*.txt)|*.txt|Tousfichiers|*.*

source: G20 - inches
fr: G20 - pouces

source: Assume that in a previous block a G20 command was issued.
fr: Suppose que dans le bloc précédent, un ordre G20 a été émis.

source: Assume that in a previous block a G21 command was issued.
fr: Suppose que dans le bloc précédent, un ordre G21 a été émis.

source: G-Code block to analyse.
fr: Bloc G-Code a analyser

source: Clear
fr: Effacer

source: Clear text int the input field.
fr: Effacer l'entier dans le champ de saisie

source: Interpretation of the G-Code.
fr: Interprétation du G-Code

source: Reconstruction of the G-Code block.
fr: Reconstruction du bloc de G-Code

source: Directory for projects:
fr: Répertoire des projets

source: Select project directory
fr: Choisir le répertoire projet

source: Objects are imported from:
fr: Importation des objets depuis.

source: Select object directory
fr: Choisir le répertoire d'objet

source: Output directory for exported NC toolpaths:
fr: Répertoire de sortie pour l'exportation des trajectoires NC

source: Select toolpath output directory
fr: Choisir le répertoire des trajectoires de sortie

source: Tool libraries:
fr: Bibliothèques d'outils

source: Select toolbox directory
fr: Choisir le répertoire des outils

source: Post-Processors:
fr: Post-Processeurs:

source: Select post-processor directory
fr: Choisir le répertoire des post-processeurs

source: Machine models:
fr: Modèles de machine:

source: Select machine-model directory
fr: Choisir le répertoire des modèles de machine

source: Name
fr: Nom

source: Diameter
fr: Diamètre

source: Number
fr: Nombre

source: Flat nose (cylindric)
fr: net plat (cylindrique)

source: Ball nose (spheric)
fr: Nez rond (sphérique)

source: Bull nose (mixing ball and flat)
fr: Nez arrondi (mélange de boule et de plat)

source: Diameter of the part that disappears inside the chuck.
fr: Diamètre de la queue dans le mandrin.

source: Vendor:
fr: vendeur:

source: This is the length of the that disappears inside the chuck.
fr: Ceci est la longueur dans le mandrin.

source: Max. speed: Look at label on box you got the tools shipped in.
fr: Vitesse max: vérifier l'indication dans la boite de définition de l'outil.

source: Product ID:
fr: ID produit.

source: Feed per tooth: How deep can a tooth cut per revolution. Usually in the range of 0.02 mm to 0.05 mm.
fr: Passe par dent: Epaisseur du copeau par tour. Couramment dans la plage 0,02 .. 0,05 mm.

source: Product link:
fr: Lien produit:

source: Number of teeth around the cutter.
fr: Nombre de dents de la fraise:

source: Millimeter
fr: Millimètre

source: Inches
fr: Pouces

source: Unit:
fr: Unité;

source: false
fr: faux

source: true
fr: vrai

source: Shoulder length:
fr: Longueur de l'épaule:

source: Tip diameter:
fr: Diamètre de la tête:

source: Tip length:
fr: Longueur de la tige:

source: Tip offset:
fr: Décakage de la tige

source: Thread profile angle:
fr: Angle du profil du filet:

source: Shape from Geometry
fr: Géométrie de la forme

source: Delete
fr: Supprimer

source: Upper Diameter:
fr: Diamètre supérieur:

source: Diameter of the tool at the end of this segment.
fr: Diamètre de l'outil à la fin de ce morceau.

source: Lower Diameter:
fr: Diamètre inférieur:

source: Height of this segment.
fr: Hauteur du morceau:

source: Radius of curvature: Positive radius = convex surface = bulged to the outside. Negative radius = concave surface = bulged to the inside. Radius of 0 = straight line.
fr: Rayon de courbure: Rayon positif = surface convexe = forme vers l'extérieur. Rayon négatif = surface concave = forme vers l'intérieur. Rayon nul = ligne droite.

source: Upper
fr: Supérieur

source: Lower
fr: Inférieur

source: Height
fr: Hauteur

source: Shape
fr: Forme

source: None
fr: Aucune

source: Holder definition below
fr: Défintion de l'étau ci-dessous

source: Holder
fr: Etau

source: Shaft from Geometry
fr: Géométrie de l'axe

source: Shaft
fr: Axe

source: Set
fr: Met

source: Name:
fr: Nom:

source: Tool coolant:
fr: Arrosage d'outil:

source: Feed
fr: Pied

source: per Revolution:
fr: par Tour:

source: per Tooth:
fr: par Outil:

source: Spindle speed:
fr: Vitesse de broche:

source: Spindle speed-ramp:
fr: Vitesse de progression de la broche:

source: Speed
fr: Vitesse

source: Cutting feedrate:
fr: Avance de coupe:

source: Avg. feedrate:
fr: Vitesse d'avance:

source: Lead-in feedrate:
fr: Vitesse d'avance intérieure

source: Lead-out feedrate:
fr: Vitesse d'avance extérieure

source: Plunge feedrate:
fr: Vitesse d'avance en plongée

source: Ramp feedrate:
fr: Vitesse d'avance de progression

source: Retraction feedrate:
fr: Vitesse de rétraction

source: Feeds&& Speeds
fr: Vitesse&& Pieds

source: Live
fr: En direct

source: Comment:
fr: Commentaire:

source: Number:
fr: Nombre:

source: Manual tool chain
fr: Chaîne d'outils manuels

source: Break control
fr: Maîtriser l'arrêt

source: Diameter offset:
fr: Décalage du diamètre

source: Length offset:
fr: Longueur du décalage:

source: Turret:
fr: Tourelle :

source: Machine Description
fr: Description de la machine

source: Evaluate Script
fr: Script d'évaluation

source: Settings
fr: Configuration

source: Show Controller
fr: Voir le controleur d'axes

source: Evaluate
fr: Evaluer

source: Hide &Controller
fr: Cacherle &Controleur

source: &Controller
fr: &Controleur

source: &Preferences
fr: &Préférences

source: Tool Tip
fr: Conseils

source: Normal Vector
fr: Vecteur normal

source: Units
fr: Unités

source: Length
fr: Longueur

source: Linear Speed
fr: Vitesse linéaire

source: Rotational Speed
fr: Vitesse de rotation

source: Time
fr: Durée

source: Small Distance
fr: Petite distance

source: Tolerance
fr: Tolérance

source: Unit conversion is only used for displaying. Internally everything is stored in SI base units. Please use Object->Modify to change object sizes.
fr: La conversion des unités n'est utilisée que pour l'affichage. En interne, tout est stocké en unités de base SI. Veuillez utiliser Objet->Modifier pour modifier la taille des objets.

source: Check library for connected devices.
fr: Verifie les bibliothèques pour la connexion matériel

source: Close all connection and disconnect and reconnect to the underlying library.
fr: Fermez toutes les connexions, déconnectez et reconnectez-vous à la bibliothèque sous-jacente.

source: Connect to selected midi port.
fr: Connexion au port midi choisi.

source: Disconnect from midi port.
fr: Déconnexion du port midi

source: Close this window.
fr: Fermer cett fenêtre

source: Received Messages
fr: Messages reçus

source: Doubleclick to clear.
fr: Double clic pour effacer.

source: G-Code parser
fr: Analyseur de G-Code

source: Setup Paths
fr: Choix des chemins

source: Toolbox
fr: Catalogue d'outils

source: Machine Controller
fr: Controleur machine

source: Setup Display Units
fr: Choix des unités d'affichage

source: Setup MIDI Connection
fr: Choix de la connexion MIDI

source: Left Eye
fr: Oeil gauche

source: Right Eye
fr: Oeil droit

source: <- Swap Colors ->
fr: <- Inverser les Couleurs ->

source: Eye Distance:
fr: Distance des yeux :

source: Focal Distance:
fr: Distance focale:

source: Setup Stereo
fr: Choix de la stéréo

source: GTS file not readable!
fr: Ne peut ouvrir le fichier GTS !

source: STL file not readable!
fr: STL fichier illisible !

source: DXF file not readable!
fr: Ne peut ouvrir le fichier DXF !

source: OBJ file not readable!
fr: Ne peut ouvrir le fichier OBJ !

source: Untitled
fr: Sans-titre

source: Area Grid (Dexel)
fr: Zone grillagée (Dexel)

source: X first then Y
fr: X avant Y

source: Y first then X
fr: Y avant X

source: Overlap:
fr: Recouvrement:

source: Distance between two rows.
fr: Distance entre deux lignes.

source: Max. single step:
fr: Max. simple pas:

source: Raise step:
fr: Augmenter le pas:

source: Drop step:
fr: Diminution du pas:

source: Drillpattern (dexel-based)
fr: Schéma de perçage (à base de dexel)

source: Load G-Code from file...
fr: Charger un fichier G-Code ...

source: Load G-Code: Not a valid file: >
fr: Chargement G-Code invalide: >

source: Max. rest error:
fr: Max. erreur :

source: Twiddle factor:
fr: Facteur double:

source: Test (dexel-based)
fr: Test ( avec dexel)

source: ---------- error while parsing ----------
fr: ---------- Erreur lors de l'analyse ----------

source: ---------- error while running ----------
fr: ---------- Erreur lors de l'exécution ----------

source: File format for machine descriptions not supported.
fr: Format de fichier de description machine non supporté.
